package com.dongmin.scbus.model

import android.os.Parcelable
import kotlinx.android.parcel.Parcelize

@Parcelize
class Bus20_1 : Bus(), Parcelable {
    override var stationNames = arrayOf(
        "삼척종합버스터미널",
        "현대정형외과",
        "홈플러스",
        "교동주민센터",
        "상공회의소",
        "현대상가",
        "삼척의료원",
        "터미널앞",
        "삼척역",
        "오분동",
        "한재밑",
        "승공마을",
        "맹방초등학교",
        "맹방주유소",
        "하맹방리",
        "교가4리.옥계",
        "교가5리.무릉",
        "도원",
        "근덕초.교곡분교",
        "교곡1리.예비군훈련장",
        "교곡1리",
        "교곡1리.들입재",
        "개산.고봉암",
        "하월산리",
        "상월산리",
        "상군천리",
        "둔달리",
        "상군천리",
        "상월산리",
        "하월산리",
        "고자리",
        "고자리.아진골",
        "여삼입구",
        "상방천.한도골앞",
        "하반천",
        "상천기리",
        "천기",
        "천기삼거리",
        "상정",
        "하정리",
        "동산입구",
        "상거노2리",
        "하거노3리",
        "미로중학교",
        "미로역",
        "미로면사무소",
        "사둔1리",
        "무사리",
        "도경",
        "도경교차로",
        "운전학원",
        "평전동",
        "자원동",
        "서부초등학교앞",
        "원당주공아파트",
        "성북삼거리",
        "죽서루",
        "삼척의료원",
        "삼척종합버스터미널"

    )
    override var id: String = "20-1"
    override var stationTimes = "삼척터미널출발시간 : 07:30(상행 근덕), 13:20(하행 천기), 17:40(상행 천기)"
    override var departTimes = "상군천출발시간 : 08:20(하행 근덕), 14:10(상행 천기), 18:20(하행 근덕)"
}