package com.dongmin.scbus.model

import android.os.Parcelable
import kotlinx.android.parcel.Parcelize

@Parcelize
class Bus21_1 : Bus(), Parcelable {
    override var stationNames = arrayOf(
        "삼척종합버스터미널",
        "삼척의료원",
        "성내치안센터",
        "상공회의소",
        "삼척고교",
        "향교앞",
        "강원대학교삼척캠퍼스",
        "종합운동장",
        "삼척해수욕장입구",
        "증산마을",
        "추암입구",
        "대구동",
        "북평공단",
        "북평국가산업단지",
        "이주단지",
        "북평장터",
        "북평주민센터",
        "동해항",
        "천일화물앞",
        "우리등연합의원",
        "동해역",
        "송정초등학교",
        "주유소앞",
        "동해항",
        "효가동변전소",
        "효가사거리",
        "북평중학교","양지마을","북삼동숫골입구","주공5차아파트","현대아파트","센트로빌아파트","주공2차","동해시보건소","시청","천일서점","중앙초","한양아파트","공영버스터미널","주공6차","동해감리교회","제1함대사령부","고속버스터미널","부곡삼거리","동호육교","농수산물시장","동해프라자","우리은행앞","새마을금고","발한중앙시장","사문재","묵호여중"
        )
    override var id: String = "21-1"
    override var stationTimes = "삼척터미널출발시간 : 06:00, 06:33(주말공휴일미운행), 07:03, 07:33, 08:03, 08:53, 09:03, 09:33(주말공휴일미운행), 09:53, 10:03, 10:33, 10:53, 11:23, 11:33, 12:03, 12:33(주말공휴일미운행), 12:53, 13:03, 13:33, 13:53, 14:33, 14:53, 15:33, 15:53(주말공휴일미운행), 16:03, 16:33, 16:53, 17:03, 18:03, 18:33, 19:03"
    override var departTimes = "발한삼거리출발시간 : 06:50, 07:10, 07:50(주말공휴일미운행), 08:20, 08:50, 09:20, 10:10, 10:20, 10:50(주말공휴일미운행), 11:10, 11:20, 11:50, 12:20, 12:40, 12:50, 13:20, 13:50(주말공휴일미운행), 14:10, 14:20, 14:50, 15:20, 15:50, 16:10, 16:50(주말공휴일미운행), 17:10, 17:20, 17:50, 18:10, 18:20, 19:20, 19:50, 20:20"
    override var etc = "목적지가 동해일 경우 버스요금이 다릅니다. 승차 전 기사님께 목적지를 말해주세요"
}