package com.dongmin.scbus.model

import android.os.Parcelable
import kotlinx.android.parcel.Parcelize

@Parcelize
class Bus21_3 : Bus(), Parcelable {
    override var stationNames = arrayOf(
        "삼척종합버스터미널",
        "삼척의료원",
        "성내치안센터",
        "상공회의소",
        "삼척고교",
        "향교앞",
        "강원대학교삼척캠퍼스",
        "종합운동장",
        "삼척해수욕장입구",
        "증산마을",
        "추암입구",
        "대구동",
        "북평공단",
        "북평국가산업단지",
        "이주단지",
        "북평장터",
        "북평주민센터",
        "동해항",
        "효가동변전소",
        "효가사거리",
        "북평중학교",
        "양지마을",
        "북삼동숫골입구",
        "주공5차아파트",
        "현대아파트",
        "센트로빌아파트",
        "주공2차",
        "동해시보건소",
        "시청",
        "천일서점",
        "중앙초",
        "한양아파트",
        "공영버스터미널",
        "제1함대사령부",
        "동해병원",
        "다이소앞",
        "부영아파트",
        "부곡",
        "고속버스터미널",
        "부곡삼거리",
        "동호육교",
        "농수산물시장",
        "동해프라자",
        "우리은행앞",
        "새마을금고",
        "발한중앙시장",
        "사문재",
        "묵호여중"

    )
    override var id: String = "21-3"
    override var stationTimes = "삼척터미널출발시간 : 08:23, 10:23, 13:23, 16:23"
    override var departTimes = "발한삼거리출발시간 : 09:40, 11:40, 14:40, 17:40"
    override var etc = "목적지가 동해일 경우 버스요금이 다릅니다. 승차 전 기사님께 목적지를 말해주세요"
}