package com.dongmin.scbus.model

import android.os.Parcelable
import kotlinx.android.parcel.Parcelize

@Parcelize
class Bus31_7 : Bus(), Parcelable {
    override var stationNames = arrayOf(
        "삼척종합버스터미널",
        "현대정형외과",
        "홈플러스",
        "교동주민센터",
        "상공회의소",
        "현대상가",
        "죽서루",
        "성북삼거리",
        "원당동",
        "원당현대아파트",
        "서부초등학교앞",
        "자원동",
        "평전동",
        "운전학원",
        "도경교차로",
        "도경",
        "무사리",
        "사둔1리",
        "미로면사무소",
        "미로역",
        "미로중학교",
        "하거노3리",
        "상거노2리",
        "동산입구",
        "하정리",
        "상정",
        "천기삼거리",
        "천기",
        "천기.활기입구",
        "신기",
        "신곡초등학교",
        "신기",
        "안의리",
        "대평리—신기리",
        "신기역",
        "신기",
        "신곡초등학교",
        "신기",
        "천기.활기입구",
        "천기리",
        "천기삼거리",
        "상정리",
        "하정리",
        "동산입구",
        "상거노2리",
        "하거노3리",
        "미로중학교",
        "미로역",
        "미로면사무소",
        "사둔1리",
        "무사리",
        "도경",
        "도경교차로앞",
        "등봉동",
        "평전동",
        "자원동",
        "한양아파트",
        "농산물품질관리원",
        "성북삼거리",
        "성내치안센터",
        "상공회의소",
        "삼척고교",
        "홈플러스",
        "삼척축협",
        "삼척종합버스터미널"

    )
    override var id: String = "31_7"
    override var stationTimes = "삼척터미널출발시간 : 09:50, 12:30, 15:40"
    override var departTimes = "신기출발시간 : 10:25(대평), 13:05(대평), 16:15(신기)"
}