package com.dongmin.scbus.model

import android.os.Parcelable
import kotlinx.android.parcel.Parcelize

@Parcelize
class Bus33 : Bus(), Parcelable {
    override var stationNames = arrayOf(
        "삼척터미널",
        "현대정형외과",
        "홈플러스",
        "교동주민센터",
        "상공회의소",
        "현대상가",
        "죽서루",
        "성북삼거리",
        "원당동",
        "원당현대아파트",
        "서부초등학교앞",
        "자원동",
        "평전동",
        "운전학원",
        "도경교차로",
        "도경",
        "무사리",
        "사둔1리",
        "미로면사무소",
        "미로역",
        "미로중학교",
        "하거노3리",
        "새마을.하거노3리",
        "하거노리",
        "삼거리",
        "구룡골",
        "상사전삼거리",
        "번천.거무소",
        "번천.복상골",
        "숙암",
        "하장면사무소",
        "광동",
        "숙암",
        "번천.복상골",
        "번천.거무소",
        "상사전삼거리",
        "구룡골",
        "삼거리",
        "하거노리",
        "새마을.하거노3리",
        "하거노3리",
        "미로중학교",
        "미로역",
        "미로면사무소",
        "사둔1리",
        "무사리",
        "도경",
        "도경교차로앞",
        "등봉동",
        "평전동",
        "자원동",
        "한양아파트",
        "농산물품질관리원",
        "성북삼거리",
        "성내치안센터",
        "상공회의소",
        "삼척고교",
        "홈플러스",
        "삼척축협",
        "삼척터미널"

    )
    override var id: String = "33"
    override var stationTimes = "삼척터미널출발시간 : 07:20, 13:30, 16:30"
    override var departTimes = "하장출발시간 : 08:40, 14:50, 18:00"
}