package com.dongmin.scbus.model

import android.os.Parcelable
import kotlinx.android.parcel.Parcelize

@Parcelize
class Bus60 : Bus(), Parcelable {
    override var stationNames = arrayOf(
        "삼척터미널",
        "삼척의료원",
        "죽서루",
        "성북삼거리",
        "원당동",
        "원당현대아파트",
        "서부초등학교앞",
        "자원동",
        "평전동",
        "운전학원",
        "도경교차로",
        "도경",
        "무사리",
        "사둔1리",
        "미로면사무소",
        "미로역",
        "미로중학교",
        "하거노3리",
        "상거노2리",
        "동산입구",
        "하정리",
        "상정",
        "천기삼거리",
        "천기",
        "천기.활기",
        "신기",
        "신곡초등학교",
        "환선굴입구",
        "서하리",
        "고무릉",
        "대기리입구",
        "대이리",
        "환선굴",
        "대이리",
        "대기리입구",
        "고무릉",
        "서하리",
        "환선굴입구",
        "신곡초등학교",
        "신기",
        "천기.활기입구",
        "천기리",
        "천기삼거리",
        "상정리",
        "하정리",
        "동산입구",
        "상거노2리",
        "하거노3리",
        "미로중학교",
        "미로역",
        "미로면사무소",
        "사둔1리",
        "무사리",
        "도경",
        "도경교차로앞",
        "등봉동",
        "평전동",
        "자원동",
        "한양아파트",
        "농산물품질관리원",
        "성북삼거리",
        "삼척의료원",
        "터미널앞",
        "삼척터미널"

    )
    override var id: String = "60"
    override var stationTimes = "삼척터미널출발시간 : 6:30, 8:30, 10:30, 14:20, 17:40"
    override var departTimes = "환선굴출발시간 : 7:10, 9:15, 11:20, 15:05, 18:25"

}